#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.ec2.aws_key_pair.moveo_key_pair: Refreshing state... [id=moveo-key]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-051c497f8d117cb89]
module.vpc.aws_vpc.task-vpc: Refreshing state... [id=vpc-03df96f6ebae98360]
module.bastion.aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking]
aws_s3_bucket.terraform_state_moveo: Refreshing state... [id=terraform-backend-bucket-moveo-ravid]
module.vpc.aws_subnet.PrSubnet: Refreshing state... [id=subnet-0850132d4c76432fc]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0eb5c1a1f13b09a91]
module.vpc.aws_subnet.PbSubnet_2: Refreshing state... [id=subnet-0958ab33ed87db374]
module.vpc.aws_subnet.PbSubnet: Refreshing state... [id=subnet-045722ff5152b8ab5]
module.alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:767397887878:targetgroup/tg/af5e0dbe049a42ba]
module.sg.aws_security_group.sg: Refreshing state... [id=sg-0a78558894d00c746]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-07dc03b0cdfbad132]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:767397887878:loadbalancer/app/moveo-load-balancer/fc841dd31276f1b2]
module.bastion.aws_instance.bastion_instance: Refreshing state... [id=i-088669a7393d2ae45]
module.ec2.aws_instance.moveo_instance: Refreshing state... [id=i-025af2faddef28283]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-0782345c0754bab69]
module.vpc.aws_route_table.private_route_table: Refreshing state... [id=rtb-0866c8f43139f943b]
module.vpc.aws_route_table_association.public_route_table_Association: Refreshing state... [id=rtbassoc-0415786ec5ebb82f1]
module.vpc.aws_route_table_association.private_route_table_Association: Refreshing state... [id=rtbassoc-032b1f817d0f9bda5]
module.alb.aws_lb_target_group_attachment.tga: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:767397887878:targetgroup/tg/af5e0dbe049a42ba-20240821121035689500000003]
module.alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:767397887878:listener/app/moveo-load-balancer/fc841dd31276f1b2/6260ccd9d3c694a0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2.aws_instance.moveo_instance has been deleted
  - resource "aws_instance" "moveo_instance" {
      - id                                   = "i-025af2faddef28283" -> null
        tags                                 = {
            "Name" = "moveo-task-instance-1"
        }
        # (40 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.alb.aws_lb_target_group_attachment.tga will be created
  + resource "aws_lb_target_group_attachment" "tga" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:767397887878:targetgroup/tg/af5e0dbe049a42ba"
      + target_id        = (known after apply)
    }

  # module.ec2.aws_instance.moveo_instance will be created
  + resource "aws_instance" "moveo_instance" {
      + ami                                  = "ami-04e49d62cf88738f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "eu-west-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "moveo-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0850132d4c76432fc"
      + tags                                 = {
          + "Name" = "moveo-task-instance"
        }
      + tags_all                             = {
          + "Name" = "moveo-task-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "50fb0efb96e879e92cc3b92075824ab5ab2e0f35"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0a78558894d00c746",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @RavidShlomian, Action: `pull_request`*